artefacts/ess-org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-01 Thu 20:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>using ESS with Emacs Org Mode</title>
<meta name="author" content="Greg Minshall" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">using ESS with Emacs Org Mode
<br />
<span class="subtitle">part of the ESS intro series</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3a6662e">using ESS with Emacs Org Mode</a>
<ul>
<li><a href="#org4453ebf">Introduction to Org Mode</a></li>
<li><a href="#org9cb15bd">Babel &#x2013; programming language support in org files</a></li>
<li><a href="#orge4c3781">Org Mode community</a></li>
<li><a href="#org7a4626f">Other tutorials, etc.</a></li>
<li><a href="#org73f18f2">code blocks</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3a6662e" class="outline-2">
<h2 id="org3a6662e">using ESS with Emacs Org Mode</h2>
<div class="outline-text-2" id="text-org3a6662e">
</div>
<div id="outline-container-org4453ebf" class="outline-3">
<h3 id="org4453ebf">Introduction to Org Mode</h3>
<div class="outline-text-3" id="text-org4453ebf">
<p>
basics: document structuring, tables, math/LaTeX, exporting
</p>

<p>
<a href="https://www.gnu.org/software/emacs/">Emacs</a> (<a href="https://en.wikipedia.org/wiki/Emacs">wikipedia</a>) <a href="https://orgmode.org/">Org Mode</a> <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>  sometimes exhorts one to do something like "Organize Your
Life In Plain Text!"; the Org Mode manual, on the other hand, starts
off by saying, "Org is an outliner".  The philosophy of Org Mode
(indeed, of Emacs, and maybe, to some extent, of any of the *nix
operating systems) is that using non-proprietary file formats and
software provides the most "liberating" and "horizon-free" way of
taking advantage of modern information technology.  And, to some
extent, that a mostly-command line interface, rather than a graphical
user interface, is also "the way to go".
</p>

<p>
I think Org Mode started off as a way of simplifying the creation of
formatted documents, with tables, etc., for taking notes, creating
agendas (items with date elements), and evolved into a much larger
system of utilities for, for example, converting ("exporting", in org
mode parlance) between the Org Mode syntax to .html, .pdf, etc.,
documents, with good support for doing mathematical (LaTeX)
formatting.
</p>

<p>
Org Mode does a good job exporting to LaTeX, html.  (Some people
primarily use Org Mode as a more "user friendly" interface to LaTeX,
though for serious documents, in the final analysis they probably
spend a lot of time tweaking LaTeX, and org-to-LaTeX, configuration.)
</p>

<p>
Though I have used Org Mode for more than a decade, I know very little
of most of its capabilities, as I mostly use it to centralize the
source code within a project, as well as to produce the random
document, especially documents with embedded code segments (known, in
Org Mode, as "source blocks").
</p>

<p>
Org Mode is bundled into the main Emacs distribution, but a
more-than-casual user might like to use the more-than-likely
up-to-date package available via <a href="https://melpa.org/">melpa</a> (<code>[M-x package-list-packages]</code>,
and regexp-search for /^..org /).
</p>

<p>
The official <a href="https://orgmode.org/quickstart.html">Quick Start</a> guide provides a very good introduction to
Org Mode.  The main <a href="https://orgmode.org/">Org Mode</a> web page is another good source for
further information, as is the Org Mode <a href="https://orgmode.org/worg/">worg</a> site.  (You may find it
useful to take a linear stroll through <a href="https://orgmode.org/worg/sitemap.html">the worg site map</a>.)  Also, once
installed on your system, the Org Mode info pages are available in
Emacs (or, using <code>info(1)</code>).
</p>
</div>


<div id="outline-container-org31a85ef" class="outline-4">
<h4 id="org31a85ef">Blocks of various sizes, shapes, colors</h4>
<div class="outline-text-4" id="text-org31a85ef">
<p>
Various sorts of "blocks" are supported in Org Mode files.  These
start with <code>#begin_...</code>, and end with a corresponding <code>#end_...</code>,
where the <code>...</code> are something like <code>src</code>, <code>example</code>, <code>quote</code>.  A
skeleton for one of these can conveniently be created by, in column 1
of an otherwise empty line, typing <code>[&lt;X]</code> followed by <code>[tab]</code>, where
<code>X</code> is one of
</p>
<ul class="org-ul">
<li><code>e</code> for an example block (line wrapping does not apply) (<code>#+begin_example</code>)</li>
<li><code>q</code> for a quote block (line wrapping applies) (<code>#+begin_quote</code>)</li>
<li><code>s</code> for a source block (<code>#+begin_src</code>)</li>
</ul>

<p>
there are various other blocks; you can experiment by typing (in
column one, of an otherwise empty line) <code>[&lt;]</code> and then one of the
following, and hitting <code>[tab]</code>:
</p>
<pre class="example">
a, c, C, E, h, l, v
</pre>

<p>
seeing what you get, looking in the manual.  (Of course, one can
always search the manual for <code>#[+]begin_</code>.)
</p>

<p>
In addition to the source blocks mentioned above (and elaborated on
below), Org Mode allows short bits of "verbatim" code to be introduced
by a colon as the first non-blank column of a line
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #b3b3b3;">: this is verbatim</span>
</pre>
</div>

<p>
One can have longer runs of verbatim ("example") data (which is not
word wrapped, etc.:
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+name: ex</span>
<span style="color: #ff7f24;">#+begin_example</span>
this is a block
that
holds more verbatim text
<span style="color: #ff7f24;">#+end_example</span>
</pre>
</div>

<p>
As well as longer bits of text that <b>will</b> be wrapped ("quote"):
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+begin_quote</span>
this is a bit of
text that should
show up, eventually, strung out in a smaller
number
of
lines when "filled"
(e.g., [M-x org-fill-paragraph], [M-q])
<span style="color: #ff7f24;">#+end_quote</span>
</pre>
</div>

<p>
Blocks can optionally have <a href="#org038ad62">names</a>.  These names can be used as <a href="#org5bb0595">noweb</a>
references, or to use the value of a block (or, if a source block, of
the block's results) as input (a <a href="#orgbbab0e0">variable</a>) to another block in the
file.<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
</p>
</div>
</div>
</div>

<div id="outline-container-org9cb15bd" class="outline-3">
<h3 id="org9cb15bd">Babel &#x2013; programming language support in org files</h3>
<div class="outline-text-3" id="text-org9cb15bd">
<p>
<a href="https://orgmode.org/worg/org-contrib/babel/intro.html">Babel</a> is one name for talking about programming language support in
Org Mode.  You are able to embed source code inside of Org Mode
buffers, edit these code blocks in a language-specific way, evaluate
code blocks, pass the results of the evaulation of one code block to
another code block, and include code blocks and/or the results of
their evaulation in the document produced by exporting the org buffer.
</p>
</div>
