ess-org.org
*** <<sourceblocks>> Source blocks

The Org Mode [[https://orgmode.org/guide/][Compact Guide]] has [[https://orgmode.org/guide/Working-with-Source-Code.html][a section]] on source blocks.  A separate
[[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-R.html]["worg" page]] gives information on using R with Org Mode.  The list of
languages supported by Org Mode is documented [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][here]].

An Org Mode source block includes source code (in one language, per
source block), an optional [[naming][name]], and optional /[[headerargs][header arguments]]/.

Org Mode source blocks look like this
#+BEGIN_SRC org
  ,#+name: ex
  ,#+begin_example
  this is a block
  that
  holds more verbatim text
  ,#+end_example

  ,#+begin_src R :var foo=ex :exports both
  foo
  ,#+end_src

  ,#+RESULTS:
  | this is a block          |
  | that                     |
  | holds more verbatim text |
  |                          |

  ,#+begin_src R :var foo=ex :exports code
  foo
  ,#+end_src

  ,#+RESULTS:
  | this is a block          |
  | that                     |
  | holds more verbatim text |
  |                          |

#+END_SRC

(As mentioned above, a source block skeleton can be created by
typing, in column 1, =<s=, and hitting =tab=.)

Source blocks can also be expressed using a =src_LANG= construct; a
=#+name:= line can be used to name the =src_LANG= block.

#+BEGIN_SRC org
  ,#+name: whyo
  src_R{"42"} {{{results(=42=)}}}

  ,#+begin_src R :var x=whyo :exports results
  x
  ,#+end_src

  ,#+RESULTS:
  | 42 |
  |    |

#+END_SRC

=src_LANG= constructs also have a syntax for defining [[headerargs][=header arguments=]].

*** Evaluating source blocks

Once written, a source block can be evaluated[fn:: for security
reasons, you will need to set or customize the Emacs variable
=org-babel-load-languages= , via =org-babel-do-load-languages= if you
are doing this to in a current Emacs session, and you will be prompted
each time before a code block is evaluated.], returning [[results][results]],
either the output of the code, or some terminating "value" of the
code, as an element of the .org file.  And, the blocks can be
evaluated manually, or -- and optionally, block by block -- while
exporting a .org file to a different format.

A source block can be evaluated in one of two sorts of contexts,
within a "session", or outside of a "session".  A "session" here means
some process that retains state between evaulations of (possibly
different, but using the same programming language) source blocks.  On
the other hand, a "non-session" starts up with no internal state from
prior runs [fn::obviously, prior runs may have, e.g., changed the
state of the file system on which all these evaulations are running;
that is, the *external* state may by influenced by what has previously
been evaluated.].


Finally, and of particular interest in these tutorials, is the fact
that Org Mode uses ESS to provide R language support.

*** <<naming>> Naming blocks

Org Mode source blocks can be named.  The name can be used to include
the *source* of one block in another block via [[noweb][noweb]], or to include
the *results* of the evaluation of one block as an input [[variables][variable]] to
another block.

Org Mode source blocks are named with a =#+name:= line:
#+BEGIN_SRC org
  ,#+name: somecode
  ,#+begin_src R :results output
	  cat("this is *some* code!\n")
  ,#+end_src

  ,#+RESULTS: somecode
  : this is *some* code!

  ,#+name: someothercode
  ,#+begin_src R :results value
	  whynot <- "this is some *other* code!"
  ,#+end_src

  ,#+RESULTS: someothercode
  : this is some *other* code!

#+END_SRC

*** <<headerargs>> Header arguments
