artefacts/ess-org.html

<div id="outline-container-org92bdf40" class="outline-4">
<h4 id="org92bdf40"><a id="org19d99cc"></a> Source blocks</h4>
<div class="outline-text-4" id="text-org92bdf40">
<p>
The Org Mode <a href="https://orgmode.org/guide/">Compact Guide</a> has <a href="https://orgmode.org/guide/Working-with-Source-Code.html">a section</a> on source blocks.  A separate
<a href="https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-R.html">"worg" page</a> gives information on using R with Org Mode.  The list of
languages supported by Org Mode is documented <a href="https://orgmode.org/worg/org-contrib/babel/languages/index.html">here</a>.
</p>

<p>
An Org Mode source block includes source code (in one language, per
source block), an optional <a href="#org038ad62">name</a>, and optional <i><a href="#org6254a44">header arguments</a></i>.
</p>

<p>
Org Mode source blocks look like this
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+name: ex</span>
<span style="color: #ff7f24;">#+begin_example</span>
this is a block
that
holds more verbatim text
<span style="color: #ff7f24;">#+end_example</span>

<span style="color: #ff7f24;">#+begin_src R :var foo=ex :exports both</span>
<span style="color: #b3b3b3;">foo</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #87cefa;">| this is a block          |</span>
<span style="color: #87cefa;">| that                     |</span>
<span style="color: #87cefa;">| holds more verbatim text |</span>
<span style="color: #87cefa;">|                          |</span>

<span style="color: #ff7f24;">#+begin_src R :var foo=ex :exports code</span>
<span style="color: #b3b3b3;">foo</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #87cefa;">| this is a block          |</span>
<span style="color: #87cefa;">| that                     |</span>
<span style="color: #87cefa;">| holds more verbatim text |</span>
<span style="color: #87cefa;">|                          |</span>

</pre>
</div>

<p>
(As mentioned above, a source block skeleton can be created by
typing, in column 1, <code>&lt;s</code>, and hitting <code>tab</code>.)
</p>

<p>
Source blocks can also be expressed using a <code>src_LANG</code> construct; a
<code>#+name:</code> line can be used to name the <code>src_LANG</code> block.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+name: whyo</span>
src_R{"42"} <span style="color: #deb887;">{{{results(</span><span style="color: #b3b3b3;">=42=</span><span style="color: #deb887;">)}}}</span>

<span style="color: #ff7f24;">#+begin_src R :var x=whyo :exports results</span>
<span style="color: #b3b3b3;">x</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #87cefa;">| 42 |</span>
<span style="color: #87cefa;">|    |</span>

</pre>
</div>

<p>
<code>src_LANG</code> constructs also have a syntax for defining <a href="#org6254a44"><code>header arguments</code></a>.
</p>
</div>
</div>

<div id="outline-container-orgda92e1c" class="outline-4">
<h4 id="orgda92e1c">Evaluating source blocks</h4>
<div class="outline-text-4" id="text-orgda92e1c">
<p>
Once written, a source block can be evaluated<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>, returning <a href="#org74f2034">results</a>,
either the output of the code, or some terminating "value" of the
code, as an element of the .org file.  And, the blocks can be
evaluated manually, or &#x2013; and optionally, block by block &#x2013; while
exporting a .org file to a different format.
</p>

<p>
A source block can be evaluated in one of two sorts of contexts,
within a "session", or outside of a "session".  A "session" here means
some process that retains state between evaulations of (possibly
different, but using the same programming language) source blocks.  On
the other hand, a "non-session" starts up with no internal state from
prior runs <sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>.
</p>


<p>
Finally, and of particular interest in these tutorials, is the fact
that Org Mode uses ESS to provide R language support.
</p>
</div>
</div>

<div id="outline-container-org621922b" class="outline-4">
<h4 id="org621922b"><a id="org038ad62"></a> Naming blocks</h4>
<div class="outline-text-4" id="text-org621922b">
<p>
Org Mode source blocks can be named.  The name can be used to include
the <b>source</b> of one block in another block via <a href="#org5bb0595">noweb</a>, or to include
the <b>results</b> of the evaluation of one block as an input <a href="#orgbbab0e0">variable</a> to
another block.
</p>

<p>
Org Mode source blocks are named with a <code>#+name:</code> line:
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+name: somecode</span>
<span style="color: #ff7f24;">#+begin_src R :results output</span>
<span style="color: #b3b3b3;">    cat(</span><span style="color: #ffa07a;">"this is *some* code!\n"</span><span style="color: #b3b3b3;">)</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS: somecode</span>
<span style="color: #b3b3b3;">: this is *some* code!</span>

<span style="color: #ff7f24;">#+name: someothercode</span>
<span style="color: #ff7f24;">#+begin_src R :results value</span>
<span style="color: #b3b3b3;">    whynot </span><span style="color: #7fffd4;">&lt;-</span><span style="color: #b3b3b3;"> </span><span style="color: #ffa07a;">"this is some *other* code!"</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS: someothercode</span>
<span style="color: #b3b3b3;">: this is some *other* code!</span>

</pre>
</div>
</div>
</div>
