ess-org.org
*** <<tangling>> Tangling

While often we are content to evaluate code blocks inside the .org
file, equally often we might want to export some or all of the code
blocks for evaulation (or inspection) outside of the .org file.  For
example, we might want to use some of the code in the .org file to
create an R package.

In the world of [[https://orgmode.org/worg/org-contrib/babel/index.html][literate programming]], /tangling/ is the process of
extracting source code from a (theoretically primarily text) document.
In Org Mode, one uses =org-babel-tangle= (normally bound to =[C-c C-v
t]=) to tangle the source code blocks in a file.  The file to which a
source block will be tangled is specified in the =:tangle= attribute,
placed on the =#+src_block= line or in a =:header-args= line (in a
[[properties][properties drawer]], to apply to a subtree of the .org file, or
stand-alone as above to apply to the entire .org file).

To actually /tangle/ a file, use =]M-x org-babel-tangle]=, often bound
to =[C-c C-v t]=.

The name of the file to which a given source block is tangled is given
by the =:tangle= [[headerargs][header argument]].  Like other header arguments, the
=:tangle= header argument can be specified by one of several ways.
The first way is by specifying it adjoining the source block, either
on the =#+begin_src= line, or on an immediately preceding =#+header=
line (basically, an overflow of the =#+begin_src= line):

#+begin_src org
  ,#+begin_src R :tangle ./nosuchdirectory/foofile
  "this is some R code"
  ,#+end_src

  ,#+RESULTS:
  : this is some R code

  ,#+header: :tangle ./nosuchdirectory/anotherfile
  ,#+begin_src R
  "this is some more R code"
  ,#+end_src

  ,#+RESULTS:
  : this is some more R code
#+end_src

<<properties>> Second, the destination file to tangle a subtree's
worth of source blocks can be specified in a PROPERIES drawer on the
headline for that tree using the =header-args= property's =tangle=
attribute to name the code blocks in that branch that don't have a
"more local" =:tangle= specification.

Alternatively, using a =#+property= tag at the top of a file, you can
define a default tangle destination for all the code blocks in the
file that don't have a "more local" =:tangle= specification.

#+BEGIN_SRC org
  ,#+property: header-args :tangle ./nosuchdirectory/bigfile

  ,** this is somewhere in this file
       :PROPERTIES:
       :header-args+: :tangle very/important/code.R
       :header-args+: :noweb-ref nowcode
       :END:

  now, code blocks will carry that name
  ,#+begin_src R
      x <- "we want some code, and we want it now!"
  ,#+end_src

  ,#+RESULTS:
  : we want some code, and we want it now!

  ,** somewhere else
  ,#+begin_src R :results output
      <<nowcode>>
      cat(x, "\n")
  ,#+end_src

  ,#+RESULTS:
#+END_SRC

As you can see, the properties drawer can carry many of properties,
including the name of a destination file for [[tangling][tangling]].  The very odd
=<<nowcode>>= is our next topic: [[noweb][noweb]].

*** <<noweb>> noweb

[[https://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming-example][noweb]] is a literate programming syntax to allow referencing blocks of
code within some larger (.org file, say) context.  It allows a
programmer to re-use bits of code (sort of =#include= like).

noweb syntax is *disabled* by default.  To enable noweb syntax, one
can either enable it on the header line of each source code block,
enable it in a [[properties][properties drawer]], or, as in the following, enable it
once at the beginning of an org file:
#+BEGIN_SRC org
  ,#+property: header-args  :noweb yes
#+END_SRC

Once enabled, references of the kind =<<NAME>>= will incorporate the
contents of a previous source code block.

#+BEGIN_SRC org
  ,#+property: header-args :noweb yes

  ,#+name: fubar
  ,#+begin_src R
  "this is an example"
  ,#+end_src

  ,#+RESULTS: fubar
  : this is an example

  ,#+begin_src R
  <<fubar>>
  ,#+end_src

  ,#+RESULTS:
  : this is an example

#+END_SRC

*** <<evaulating>> Evaulating
**** =[C-c C-c]= on a source block
**** =[C-c C-c]= on an inline source block
**** =[C-c C-c]= on a #+call
**** =[C-c C-c]= on an inline-call
#+begin_src org
  ,#+name: find-orgs
  ,#+begin_src R
  1
  ,#+end_src

  ,#+RESULTS: find-orgs
  : 1

  call_find-orgs() {{{results(=1=)}}}

  ,#+call: find-orgs()

  ,#+RESULTS:
  : 1

  call_find-orgs() {{{results(=1=)}}}

#+end_src
*** <<results>> Results

#+BEGIN_SRC org
  ,#+name: somecode
  ,#+begin_src R :results output
	  cat("this is *some* code!\n")
  ,#+end_src

  ,#+RESULTS: somecode
  : this is *some* code!

  ,#+name: someothercode
  ,#+begin_src R :results value
	  whynot <- "this is some *other* code!"
  ,#+end_src

  ,#+RESULTS: someothercode
  : this is some *other* code!

#+END_SRC

