artefacts/ess-org.html

<div id="outline-container-org3b36288" class="outline-4">
<h4 id="org3b36288"><a id="org6254a44"></a> Header arguments</h4>
</div>
<div id="outline-container-org878e7ad" class="outline-4">
<h4 id="org878e7ad"><a id="org92aa496"></a> Tangling</h4>
<div class="outline-text-4" id="text-org878e7ad">
<p>
While often we are content to evaluate code blocks inside the .org
file, equally often we might want to export some or all of the code
blocks for evaulation (or inspection) outside of the .org file.  For
example, we might want to use some of the code in the .org file to
create an R package.
</p>

<p>
In the world of <a href="https://orgmode.org/worg/org-contrib/babel/index.html">literate programming</a>, <i>tangling</i> is the process of
extracting source code from a (theoretically primarily text) document.
In Org Mode, one uses <code>org-babel-tangle</code> (normally bound to <code>[C-c C-v
t]</code>) to tangle the source code blocks in a file.  The file to which a
source block will be tangled is specified in the <code>:tangle</code> attribute,
placed on the <code>#+src_block</code> line or in a <code>:header-args</code> line (in a
<a href="#org2e55ceb">properties drawer</a>, to apply to a subtree of the .org file, or
stand-alone as above to apply to the entire .org file).
</p>

<p>
To actually <i>tangle</i> a file, use <code>]M-x org-babel-tangle]</code>, often bound
to <code>[C-c C-v t]</code>.
</p>

<p>
The name of the file to which a given source block is tangled is given
by the <code>:tangle</code> <a href="#org6254a44">header argument</a>.  Like other header arguments, the
<code>:tangle</code> header argument can be specified by one of several ways.
The first way is by specifying it adjoining the source block, either
on the <code>#+begin_src</code> line, or on an immediately preceding <code>#+header</code>
line (basically, an overflow of the <code>#+begin_src</code> line):
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+begin_src R :tangle ./nosuchdirectory/foofile</span>
<span style="color: #ffa07a;">"this is some R code"</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #b3b3b3;">: this is some R code</span>

<span style="color: #ff7f24;">#+header: :tangle ./nosuchdirectory/anotherfile</span>
<span style="color: #ff7f24;">#+begin_src R</span>
<span style="color: #ffa07a;">"this is some more R code"</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #b3b3b3;">: this is some more R code</span>
</pre>
</div>

<p>
<a id="org2e55ceb"></a> Second, the destination file to tangle a subtree's
worth of source blocks can be specified in a PROPERIES drawer on the
headline for that tree using the <code>header-args</code> property's <code>tangle</code>
attribute to name the code blocks in that branch that don't have a
"more local" <code>:tangle</code> specification.
</p>

<p>
Alternatively, using a <code>#+property</code> tag at the top of a file, you can
define a default tangle destination for all the code blocks in the
file that don't have a "more local" <code>:tangle</code> specification.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+property: header-args :tangle ./nosuchdirectory/bigfile</span>

<span style="color: #eedd82;">** this is somewhere in this file</span>
     <span style="color: #87cefa;">:PROPERTIES:</span>
     <span style="color: #00ffff;">:header-args</span><span style="color: #00ffff; text-decoration: line-through;">+:</span><span style="text-decoration: line-through;"> </span><span style="text-decoration: line-through;">:tangle very/important/code.R</span>
<span style="text-decoration: line-through;">     </span><span style="color: #00ffff; text-decoration: line-through;">:header-args+</span><span style="color: #00ffff;">:</span> :noweb-ref nowcode
     <span style="color: #87cefa;">:END:</span>

now, code blocks will carry that name
<span style="color: #ff7f24;">#+begin_src R</span>
<span style="color: #b3b3b3;">    x </span><span style="color: #7fffd4;">&lt;-</span><span style="color: #b3b3b3;"> </span><span style="color: #ffa07a;">"we want some code, and we want it now!"</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #b3b3b3;">: we want some code, and we want it now!</span>

<span style="color: #eedd82;">** somewhere else</span>
<span style="color: #ff7f24;">#+begin_src R :results output</span>

<span style="color: #b3b3b3;">    cat(x, </span><span style="color: #ffa07a;">"\n"</span><span style="color: #b3b3b3;">)</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
</pre>
</div>

<p>
As you can see, the properties drawer can carry many of properties,
including the name of a destination file for <a href="#org92aa496">tangling</a>.  The very odd
<code>&lt;&lt;nowcode&gt;&gt;</code> is our next topic: <a href="#org5bb0595">noweb</a>.
</p>
</div>
</div>

<div id="outline-container-org5606764" class="outline-4">
<h4 id="org5606764"><a id="org5bb0595"></a> noweb</h4>
<div class="outline-text-4" id="text-org5606764">
<p>
<a href="https://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming-example">noweb</a> is a literate programming syntax to allow referencing blocks of
code within some larger (.org file, say) context.  It allows a
programmer to re-use bits of code (sort of <code>#include</code> like).
</p>

<p>
noweb syntax is <b>disabled</b> by default.  To enable noweb syntax, one
can either enable it on the header line of each source code block,
enable it in a <a href="#org2e55ceb">properties drawer</a>, or, as in the following, enable it
once at the beginning of an org file:
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+property: header-args  :noweb yes</span>
</pre>
</div>

<p>
Once enabled, references of the kind <code>&lt;&lt;NAME&gt;&gt;</code> will incorporate the
contents of a previous source code block.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+property: header-args :noweb yes</span>

<span style="color: #ff7f24;">#+name: fubar</span>
<span style="color: #ff7f24;">#+begin_src R</span>
<span style="color: #ffa07a;">"this is an example"</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS: fubar</span>
<span style="color: #b3b3b3;">: this is an example</span>

<span style="color: #ff7f24;">#+begin_src R</span>

<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #b3b3b3;">: this is an example</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgb180605" class="outline-4">
<h4 id="orgb180605"><a id="org27ad091"></a> Evaulating</h4>
<div class="outline-text-4" id="text-orgb180605">
</div>
<ul class="org-ul">
<li><a id="orga538535"></a><code>[C-c C-c]</code> on a source block<br /></li>
<li><a id="org15ce35a"></a><code>[C-c C-c]</code> on an inline source block<br /></li>
<li><a id="orgbf2bafb"></a><code>[C-c C-c]</code> on a #+call<br /></li>
<li><a id="org90d516b"></a><code>[C-c C-c]</code> on an inline-call<br />
<div class="outline-text-5" id="text-org90d516b">
<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+name: find-orgs</span>
<span style="color: #ff7f24;">#+begin_src R</span>
<span style="color: #b3b3b3;">1</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS: find-orgs</span>
<span style="color: #b3b3b3;">: 1</span>

call_find-orgs() <span style="color: #deb887;">{{{results(</span><span style="color: #b3b3b3;">=1=</span><span style="color: #deb887;">)}}}</span>

<span style="color: #ff7f24;">#+call: find-orgs()</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #b3b3b3;">: 1</span>

call_find-orgs() <span style="color: #deb887;">{{{results(</span><span style="color: #b3b3b3;">=1=</span><span style="color: #deb887;">)}}}</span>

</pre>
</div>
</div>
</li>
</ul>
</div>
