ess-org.org
**** :colnames and :rownames

When processing a table result of a previous source block to be used
as an input [[variables][variable]] to another code block, the =:colnames= header
argument instructs Org Mode how to interpret the first row: should it
be assumed to be a row of column names, a row of data, or should Org
Mode use a heuristic to make that determination.

Similarly, Org Mode uses =:rownames= to determine whether the first
column of each row should be considered as a name for that row, or
simply as the data of the first column of that row.

Also, when processing the *results* of a code block, these header
arguments tell some Org Mode language support routines how to deal
with column and row names of the returned result.  If left off, the
Org Mode result of evaluation will drop any language-specific column
and row names.  However, if these header arguments are set to =yes=,
language-specific column and row names will be included in the results
placed in the Org Mode buffer.

#+begin_src org
  ,#+BEGIN_SRC R
  mtcars[1:3,]
  ,#+END_SRC

  ,#+RESULTS:
  |   21 | 6 | 160 | 110 |  3.9 |  2.62 | 16.46 | 0 | 1 | 4 | 4 |
  |   21 | 6 | 160 | 110 |  3.9 | 2.875 | 17.02 | 0 | 1 | 4 | 4 |
  | 22.8 | 4 | 108 |  93 | 3.85 |  2.32 | 18.61 | 1 | 1 | 4 | 1 |

  ,#+begin_src R :colnames yes :rownames yes
  mtcars[1:3,]
  ,#+end_src

  ,#+RESULTS:
  |               |  mpg | cyl | disp |  hp | drat |    wt |  qsec | vs | am | gear | carb |
  |---------------+------+-----+------+-----+------+-------+-------+----+----+------+------|
  | Mazda RX4     |   21 |   6 |  160 | 110 |  3.9 |  2.62 | 16.46 |  0 |  1 |    4 |    4 |
  | Mazda RX4 Wag |   21 |   6 |  160 | 110 |  3.9 | 2.875 | 17.02 |  0 |  1 |    4 |    4 |
  | Datsun 710    | 22.8 |   4 |  108 |  93 | 3.85 |  2.32 | 18.61 |  1 |  1 |    4 |    1 |

#+end_src

*** <<variables>> Variables
-- in and out
entire document or a subtree of the document
*** Life in Org Src buffers
*** <<exporting>> Exporting

** Org Mode community

   mailing lists

** Other tutorials, etc.

The Org Mode [[https://orgmode.org/quickstart.html][quickstart]] is a nice way to start with Org Mode.

[[https://www.youtube.com/playlist?list=PLVtKhBrRV_ZkPnBtt_TD1Cs9PJlU0IIdE][Rainer's screencasts about Org Mode]] (now a [[https://www.udemy.com/course/getting-yourself-organized-with-org-mode/?referralCode=D0CB0D077ED5EC0788F7][course on Udemy]])

[[https://github.com/erikriverson/org-mode-R-tutorial/blob/master/org-mode-R-tutorial.org][tutorial on R and Org Mode]]
#+begin_example
From: Erik Iverson <erikriverson@gmail.com>
Date: Tue, 23 Feb 2021 12:30:03 -0800
Subject: Re: org-in-org
To: Greg Minshall <minshall@umich.edu>
Cc: emacs-orgmode <emacs-orgmode@gnu.org>
#+end_example

https://raw.githubusercontent.com/vikasrawal/orgpaper/master/orgpapers.org
or
https://github.com/vikasrawal/orgpaper/blob/master/orgpapers.org
or, more recently:
#+begin_example
From: Jeremie Juste <jeremiejuste@gmail.com>
To: Greg Minshall <minshall@umich.edu>
Subject: Re: org-in-org
Date: Tue, 23 Feb 2021 22:38:06 +0100
Cc: emacs-orgmode@gnu.org
#+end_example

** experiments                                                      :noexport:

*** audio problems
trying to get microphone to work.  used [[https://wiki.archlinux.org/index.php/PulseAudio/Troubleshooting#Microphone_not_detected_by_PulseAudio][arch pulseaudio
troubleshooting]] page.  "PulseAudio uses wrong microphone" seemed to do
it, with alsamixer:
- F6
- choose actual hardware
- F5 (i used F4)
- select "Capture" ("input source" i didn't see)
then seemed to work, but was overmodulating.  used alsamixer, lowered
level.  (took a couple of times to take effect?)

also
: pactl list sources short
: arecord -l
: pavucontrol
(click on "Input Devices", see that the other microphones -- Front,
Headset -- are unplugged, only Internal is plugged in.

*** more
#+NAME: readdata-code
#+BEGIN_SRC org

  ,#+NAME: readdata-code
  ,#+BEGIN_SRC R :results value silent

  read.data("datafile1.csv",sep=",",header=T)->mydata1


  ,#+END_SRC
#+END_SRC

#+BEGIN_SRC org
  ,#+begin_src R
	  print("abc")
  ,#+end_src

  ,#+RESULTS:
  : abc

#+END_SRC


#+BEGIN_SRC org
  ,#+begin_src R
	  print("def")
  ,#+end_src

  ,#+RESULTS:
  : def
#+END_SRC

** code blocks

there are a few pieces of information Org Mode needs to define a
block of code
- (optionally) a =name= for the block (to use to include the block's
  code in another block with [[file:ess-org.org::*<<noweb>> noweb][noweb]], or to use the block's results as
  input to another block with [[variables][:var]].
- the language of the code in the block
- various arguments (=header arguments= and =switches=) that define
  how the code interacts with its environment
- the source code itself

there are at least two ways of encoding the needed information:

*** a source block

the most "normal" way of defining source code is with a /source
block/.

#+begin_src org
  ,#+begin_src R
    "hello, world"
  ,#+end_src

  ,#+RESULTS:
  : hello, world
#+end_src

we use this form below in discussing the structure of a code block.

*** an /inline/ code block

in a second form, known as an /inline code block/, the entire block
can fit on one line (though multiple lines are possible).

#+begin_src org
  src_R{"hello, world"} {{{results(=hello\, world=)}}}
#+end_src

i don't use this form.  for this tutorial i looked at it briefly.  it
appears its semantics are different from that of source blocks.  other
than that, i will not discuss it further.

