artefacts/ess-org.html
<div id="outline-container-orgb8c24f7" class="outline-4">
<h4 id="orgb8c24f7"><a id="org74f2034"></a> Results</h4>
<div class="outline-text-4" id="text-orgb8c24f7">
<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+name: somecode</span>
<span style="color: #ff7f24;">#+begin_src R :results output</span>
<span style="color: #b3b3b3;">    cat(</span><span style="color: #ffa07a;">"this is *some* code!\n"</span><span style="color: #b3b3b3;">)</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS: somecode</span>
<span style="color: #b3b3b3;">: this is *some* code!</span>

<span style="color: #ff7f24;">#+name: someothercode</span>
<span style="color: #ff7f24;">#+begin_src R :results value</span>
<span style="color: #b3b3b3;">    whynot </span><span style="color: #7fffd4;">&lt;-</span><span style="color: #b3b3b3;"> </span><span style="color: #ffa07a;">"this is some *other* code!"</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS: someothercode</span>
<span style="color: #b3b3b3;">: this is some *other* code!</span>

</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="org3fc2826"></a>:colnames and :rownames<br />
<div class="outline-text-5" id="text-org3fc2826">
<p>
When processing a table result of a previous source block to be used
as an input <a href="#orgbbab0e0">variable</a> to another code block, the <code>:colnames</code> header
argument instructs Org Mode how to interpret the first row: should it
be assumed to be a row of column names, a row of data, or should Org
Mode use a heuristic to make that determination.
</p>

<p>
Similarly, Org Mode uses <code>:rownames</code> to determine whether the first
column of each row should be considered as a name for that row, or
simply as the data of the first column of that row.
</p>

<p>
Also, when processing the <b>results</b> of a code block, these header
arguments tell some Org Mode language support routines how to deal
with column and row names of the returned result.  If left off, the
Org Mode result of evaluation will drop any language-specific column
and row names.  However, if these header arguments are set to <code>yes</code>,
language-specific column and row names will be included in the results
placed in the Org Mode buffer.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+BEGIN_SRC R</span>
<span style="color: #b3b3b3;">mtcars[1:3,]</span>
<span style="color: #ff7f24;">#+END_SRC</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #87cefa;">|   21 | 6 | 160 | 110 |  3.9 |  2.62 | 16.46 | 0 | 1 | 4 | 4 |</span>
<span style="color: #87cefa;">|   21 | 6 | 160 | 110 |  3.9 | 2.875 | 17.02 | 0 | 1 | 4 | 4 |</span>
<span style="color: #87cefa;">| 22.8 | 4 | 108 |  93 | 3.85 |  2.32 | 18.61 | 1 | 1 | 4 | 1 |</span>

<span style="color: #ff7f24;">#+begin_src R :colnames yes :rownames yes</span>
<span style="color: #b3b3b3;">mtcars[1:3,]</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #87cefa;">|               |  mpg | cyl | disp |  hp | drat |    wt |  qsec | vs | am | gear | carb |</span>
<span style="color: #87cefa;">|---------------+------+-----+------+-----+------+-------+-------+----+----+------+------|</span>
<span style="color: #87cefa;">| Mazda RX4     |   21 |   6 |  160 | 110 |  3.9 |  2.62 | 16.46 |  0 |  1 |    4 |    4 |</span>
<span style="color: #87cefa;">| Mazda RX4 Wag |   21 |   6 |  160 | 110 |  3.9 | 2.875 | 17.02 |  0 |  1 |    4 |    4 |</span>
<span style="color: #87cefa;">| Datsun 710    | 22.8 |   4 |  108 |  93 | 3.85 |  2.32 | 18.61 |  1 |  1 |    4 |    1 |</span>

</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org59c81fe" class="outline-4">
<h4 id="org59c81fe"><a id="orgbbab0e0"></a> Variables</h4>
<div class="outline-text-4" id="text-org59c81fe">
<p>
&#x2013; in and out
entire document or a subtree of the document
</p>
</div>
</div>
<div id="outline-container-org5a0b30d" class="outline-4">
<h4 id="org5a0b30d">Life in Org Src buffers</h4>
</div>
<div id="outline-container-org83e2cc5" class="outline-4">
<h4 id="org83e2cc5"><a id="org00a8ec7"></a> Exporting</h4>
</div>
</div>

<div id="outline-container-orge4c3781" class="outline-3">
<h3 id="orge4c3781">Org Mode community</h3>
<div class="outline-text-3" id="text-orge4c3781">
<p>
mailing lists
</p>
</div>
</div>

<div id="outline-container-org7a4626f" class="outline-3">
<h3 id="org7a4626f">Other tutorials, etc.</h3>
<div class="outline-text-3" id="text-org7a4626f">
<p>
The Org Mode <a href="https://orgmode.org/quickstart.html">quickstart</a> is a nice way to start with Org Mode.
</p>

<p>
<a href="https://www.youtube.com/playlist?list=PLVtKhBrRV_ZkPnBtt_TD1Cs9PJlU0IIdE">Rainer's screencasts about Org Mode</a> (now a <a href="https://www.udemy.com/course/getting-yourself-organized-with-org-mode/?referralCode=D0CB0D077ED5EC0788F7">course on Udemy</a>)
</p>

<p>
<a href="https://github.com/erikriverson/org-mode-R-tutorial/blob/master/org-mode-R-tutorial.org">tutorial on R and Org Mode</a>
</p>
<pre class="example" id="org4d21da0">
From: Erik Iverson &lt;erikriverson@gmail.com&gt;
Date: Tue, 23 Feb 2021 12:30:03 -0800
Subject: Re: org-in-org
To: Greg Minshall &lt;minshall@umich.edu&gt;
Cc: emacs-orgmode &lt;emacs-orgmode@gnu.org&gt;
</pre>

<p>
<a href="https://raw.githubusercontent.com/vikasrawal/orgpaper/master/orgpapers.org">https://raw.githubusercontent.com/vikasrawal/orgpaper/master/orgpapers.org</a>
or
<a href="https://github.com/vikasrawal/orgpaper/blob/master/orgpapers.org">https://github.com/vikasrawal/orgpaper/blob/master/orgpapers.org</a>
or, more recently:
</p>
<pre class="example" id="org0b51532">
From: Jeremie Juste &lt;jeremiejuste@gmail.com&gt;
To: Greg Minshall &lt;minshall@umich.edu&gt;
Subject: Re: org-in-org
Date: Tue, 23 Feb 2021 22:38:06 +0100
Cc: emacs-orgmode@gnu.org
</pre>
</div>
</div>

<div id="outline-container-org73f18f2" class="outline-3">
<h3 id="org73f18f2">code blocks</h3>
<div class="outline-text-3" id="text-org73f18f2">
<p>
there are a few pieces of information Org Mode needs to define a
block of code
</p>
<ul class="org-ul">
<li>(optionally) a <code>name</code> for the block (to use to include the block's
code in another block with <a href="ess-org.html#org5606764">noweb</a>, or to use the block's results as
input to another block with <a href="#orgbbab0e0">:var</a>.</li>
<li>the language of the code in the block</li>
<li>various arguments (<code>header arguments</code> and <code>switches</code>) that define
how the code interacts with its environment</li>
<li>the source code itself</li>
</ul>

<p>
there are at least two ways of encoding the needed information:
</p>
</div>

<div id="outline-container-orged10981" class="outline-4">
<h4 id="orged10981">a source block</h4>
<div class="outline-text-4" id="text-orged10981">
<p>
the most "normal" way of defining source code is with a <i>source
block</i>.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #ff7f24;">#+begin_src R</span>
<span style="color: #b3b3b3;">  </span><span style="color: #ffa07a;">"hello, world"</span>
<span style="color: #ff7f24;">#+end_src</span>

<span style="color: #ff7f24;">#+RESULTS:</span>
<span style="color: #b3b3b3;">: hello, world</span>
</pre>
</div>

<p>
we use this form below in discussing the structure of a code block.
</p>
</div>
</div>

<div id="outline-container-org8f5f9e5" class="outline-4">
<h4 id="org8f5f9e5">an <i>inline</i> code block</h4>
<div class="outline-text-4" id="text-org8f5f9e5">
<p>
in a second form, known as an <i>inline code block</i>, the entire block
can fit on one line (though multiple lines are possible).
</p>

<div class="org-src-container">
<pre class="src src-org">src_R{"hello, world"} <span style="color: #deb887;">{{{results(</span><span style="color: #b3b3b3;">=hello\, world=</span><span style="color: #deb887;">)}}}</span>
</pre>
</div>

<p>
i don't use this form.  for this tutorial i looked at it briefly.  it
appears its semantics are different from that of source blocks.  other
than that, i will not discuss it further.
</p>
</div>
</div>
